In [1]:
import pandas as pd

In [4]:
tinatic = pd.read_csv("titanic.csv")

In [5]:
age = tinatic["Age"]

In [6]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [8]:
age_sex = tinatic[["Age", "Sex"]]

In [9]:
age_sex

      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

In [10]:
tinatic["Age"] > 35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [16]:
class_23 = tinatic[tinatic["Pclass"].isin([2,3])]

In [17]:
class_23

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
class_23 = tinatic[(tinatic["Pclass"] == 2)| (tinatic["Pclass"] == 3)]

In [20]:
class_23

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [21]:
tinatic[tinatic["Age"].notna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [22]:
tinatic.loc[tinatic["Age"] > 35 , "Name"]

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
6                                McCarthy, Mr. Timothy J
11                              Bonnell, Miss. Elizabeth
13                           Andersson, Mr. Anders Johan
15                      Hewlett, Mrs. (Mary D Kingcome)
                             ...
865                             Bystrom, Mrs. (Karolina)
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
873                          Vander Cruyssen, Mr. Victor
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
885                 Rice, Mrs. William (Margaret Norton)
Name: Name, Length: 217, dtype: object

In [25]:

tinatic.loc[(tinatic["Age"] > 35) & (tinatic["Pclass"] == 2), ["Pclass", "Age", "Name", "Sex"]]

     Pclass   Age                                               Name     Sex
15        2  55.0                   Hewlett, Mrs. (Mary D Kingcome)   female
33        2  66.0                              Wheadon, Mr. Edward H    male
148       2  36.5           Navratil, Mr. Michel ("Louis M Hoffman")    male
149       2  42.0                  Byles, Rev. Thomas Roussel Davids    male
150       2  51.0                         Bateman, Rev. Robert James    male
161       2  40.0  Watt, Mrs. James (Elizabeth "Bessie" Inglis Mi...  female
217       2  42.0                       Jacobsohn, Mr. Sidney Samuel    male
232       2  59.0                          Sjostedt, Mr. Ernst Adolf    male
236       2  44.0                                  Hold, Mr. Stephen    male
249       2  54.0                      Carter, Rev. Ernest Courtenay    male
259       2  50.0                        Parrish, Mrs. (Lutie Davis)  female
265       2  36.0                                  Reeves, Mr. David    male
272       2  41.0          Mellinger, Mrs. (Elizabeth Anne Maidment)  female
288       2  42.0                               Hosono, Mr. Masabumi    male
292       2  36.0                             Levy, Mr. Rene Jacques    male
314       2  43.0                                 Hart, Mr. Benjamin    male
317       2  54.0                               Moraweck, Dr. Ernest    male
327       2  36.0                            Ball, Mrs. (Ada E Hall)  female
344       2  36.0                            Fox, Mr. Stanley Hubert    male
346       2  40.0                          Smith, Miss. Marion Elsie  female
357       2  38.0                          Funk, Miss. Annie Clemmer  female
387       2  36.0                                   Buss, Miss. Kate  female
397       2  46.0                            McKane, Mr. Peter David    male
432       2  42.0  Louch, Mrs. Charles Alexander (Alice Adelaide ...  female
440       2  45.0        Hart, Mrs. Benjamin (Esther Ada Bloomfield)  female
450       2  36.0                              West, Mr. Edwy Arthur    male
458       2  50.0                                Toomey, Miss. Ellen  female
463       2  48.0                       Milling, Mr. Jacob Christian    male
518       2  36.0  Angle, Mrs. William A (Florence "Mary" Agnes H...  female
526       2  50.0                               Ridsdale, Miss. Lucy  female
570       2  62.0                                 Harris, Mr. George    male
582       2  54.0                         Downton, Mr. William James    male
586       2  47.0                            Jarvis, Mr. John Denzil    male
594       2  37.0                            Chapman, Mr. John Henry    male
626       2  57.0                     Kirkland, Rev. Charles Leonard    male
670       2  40.0  Brown, Mrs. Thomas William Solomon (Elizabeth ...  female
672       2  70.0                        Mitchell, Mr. Henry Michael    male
684       2  60.0                  Brown, Mr. Thomas William Solomon    male
695       2  52.0                         Chapman, Mr. Charles Henry    male
705       2  39.0     Morley, Mr. Henry Samuel ("Mr Henry Marshall")    male
706       2  45.0                      Kelly, Mrs. Florence "Fannie"  female
714       2  52.0                              Greenberg, Mr. Samuel    male
723       2  50.0                            Hodges, Mr. Henry Price    male
754       2  48.0                   Herman, Mrs. Samuel (Jane Laver)  female
772       2  57.0                                  Mack, Mrs. (Mary)  female
774       2  54.0              Hocking, Mrs. Elizabeth (Eliza Needs)  female
795       2  39.0                                 Otter, Mr. Richard    male
808       2  39.0                                  Meyer, Mr. August    male
854       2  44.0      Carter, Mrs. Ernest Courtenay (Lilian Hughes)  female
865       2  42.0                           Bystrom, Mrs. (Karolina)  female

In [26]:
tinatic.iloc[2:4, 3:5]

                                           Name     Sex
2                        Heikkinen, Miss. Laina  female
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female